In [1]:
import pandas as pd

In [4]:
pop={'Nevada':{2001:2.4, 2002:2.9},
    'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}

In [5]:
frame3=pd.DataFrame(pop)

In [6]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [7]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [8]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [9]:
pdata={'Ohio': frame3['Ohio'][:-1],
       'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [15]:
pdata2={'Ohio': frame3['Ohio'][:-1],
       'Nevada': frame3['Nevada'][:1]}
pd.DataFrame(pdata2)
#Ohio: -3:-1; Nevada: 0:1, so 2002 value not in QiePian scope, use NaN by default.

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     NaN

In [16]:
frame3.index.name='year';
frame3.columns.name='state';
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [17]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])